<?php
/**
 * ロードする
 *
 * リクエスト
 *     GET /api/load.php?id=G999A9999
 * レスポンス
 *     {
 *       "status": true,
 *       "data":{
 *          "id": "G999A9999",
 *          "value": "xxxxxxxxxxxx"
 *       }
 *     }
 */

//-----------------------------------------------------
// 定数
//-----------------------------------------------------
define('DATAFILE', 'data.txt');

//-----------------------------------------------------
// 引数を受け取る
//-----------------------------------------------------
$id = $_GET['id'];

//-----------------------------------------------------
// サーバのデータを読み込む
//-----------------------------------------------------
$data = null;

$fp = fopen(DATAFILE, 'r');
if( $fp !== null ){
	flock($fp, LOCK_SH);		// ロック
	$data = fgets($fp);			// 読み込む
	flock($fp, LOCK_UN);		// ロック解除
	fclose($fp);
}

//-----------------------------------------------------
// レスポンス
//-----------------------------------------------------
// セーブされていない場合
if( $data === null){
	echo json_encode([
		'status' => false
	]);
}
// セーブされていた場合
else{
	echo json_encode([
		'status' => true,
		'data' => [
			'id' => $id,
			'value' => $data
		]
	]);
}
